app/views/users/show.html.erb

    <li>
      <%= User.find(invitation.user_id).name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]