app/helpers/sessions_helper.rb

  def current_user
    signed_in? ? User.find(session[:current_user_id]) : nil
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]