app/controllers/invitations_controller.rb

  def create
    id1 = params[:ids][:id1]
    id2 = params[:ids][:id2]
    @invitation = Invitation.new(user_id: id1, friend_id: id2)
    @invitation.save
---
INSERT INTO "invitations" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["friend_id", 2], ["created_at", "2020-06-03 16:48:00.099296"], ["updated_at", "2020-06-03 16:48:00.099296"]]

  def destroy
    invitation = Invitation.find(params[:invitation_id])
    invitation.destroy
---
SELECT "invitations".* FROM "invitations" WHERE "invitations"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "invitations" WHERE "invitations"."id" = ?  [["id", 5]]

  def update
    invitation = Invitation.find(params[:invitation_id])
    p current_user
    invitation.update(confirmed: true)
---
SELECT "invitations".* FROM "invitations" WHERE "invitations"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
UPDATE "invitations" SET "confirmed" = ?, "updated_at" = ? WHERE "invitations"."id" = ?  [["confirmed", 1], ["updated_at", "2020-06-03 17:37:26.153683"], ["id", 19]]