app/controllers/sessions_controller.rb

  def new
    @user = User.new
    @users = User.all
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC

  def create
    name = params[:user][:name]
    @user = User.find_by(name: name)
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Kubilay"], ["LIMIT", 1]]