app/models/invitation.rb

SELECT 1 AS one FROM "invitations" WHERE "invitations"."user_id" = ? AND "invitations"."friend_id" = ? LIMIT ?  [["user_id", 2], ["friend_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "invitations" WHERE "invitations"."user_id" = ? AND "invitations"."friend_id" = ? LIMIT ?  [["user_id", 1], ["friend_id", 2], ["LIMIT", 1]]
---
  def self.reacted?(id1, id2)
    case1 = !Invitation.where(user_id: id1, friend_id: id2).empty?
    case2 = !Invitation.where(user_id: id2, friend_id: id1).empty?

SELECT 1 AS one FROM "invitations" WHERE "invitations"."user_id" = ? AND "invitations"."friend_id" = ? AND "invitations"."confirmed" = ? LIMIT ?  [["user_id", 2], ["friend_id", 1], ["confirmed", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "invitations" WHERE "invitations"."user_id" = ? AND "invitations"."friend_id" = ? AND "invitations"."confirmed" = ? LIMIT ?  [["user_id", 1], ["friend_id", 2], ["confirmed", 1], ["LIMIT", 1]]
---
  def self.confirmed_record?(id1, id2)
    case1 = !Invitation.where(user_id: id1, friend_id: id2, confirmed: true).empty?
    case2 = !Invitation.where(user_id: id2, friend_id: id1, confirmed: true).empty?

SELECT 1 AS one FROM "invitations" WHERE "invitations"."user_id" = ? AND "invitations"."friend_id" = ? AND "invitations"."confirmed" = ? LIMIT ?  [["user_id", 5], ["friend_id", 1], ["confirmed", 1], ["LIMIT", 1]]
SELECT "invitations".* FROM "invitations" WHERE "invitations"."user_id" = ? AND "invitations"."friend_id" = ? AND "invitations"."confirmed" = ?  [["user_id", 1], ["friend_id", 5], ["confirmed", 1]]
SELECT "invitations".* FROM "invitations" WHERE "invitations"."user_id" = ? AND "invitations"."friend_id" = ? AND "invitations"."confirmed" = ?  [["user_id", 5], ["friend_id", 3], ["confirmed", 1]]
---
  def self.find_invitation(id1, id2)
    if Invitation.where(user_id: id1, friend_id: id2, confirmed: true).empty?
      Invitation.where(user_id: id2, friend_id: id1, confirmed: true)[0].id
    else
      Invitation.where(user_id: id1, friend_id: id2, confirmed: true)[0].id