app/models/user.rb

  def friends
    friends_i_sent_invitation = Invitation.where(user_id: id, confirmed: true).pluck(:friend_id)
    friends_i_got_invitation = Invitation.where(friend_id: id, confirmed: true).pluck(:user_id)
---
SELECT "invitations"."user_id" FROM "invitations" WHERE "invitations"."friend_id" = ? AND "invitations"."confirmed" = ?  [["friend_id", 6], ["confirmed", 1]]
SELECT "invitations"."user_id" FROM "invitations" WHERE "invitations"."friend_id" = ? AND "invitations"."confirmed" = ?  [["friend_id", 4], ["confirmed", 1]]